Tekla.Structures.Drawing.Drawing
The Drawing class represents a drawing in Tekla Structures.

Tekla.Structures.Drawing.Drawing.DrawingTypeStr
The type of the drawing

Tekla.Structures.Drawing.Drawing.Name
The name of the drawing.

Tekla.Structures.Drawing.Drawing.UpToDateStatus
Gets the drawing up to date status.

Tekla.Structures.Drawing.Drawing.IsMasterDrawing
Describes whether the drawing is a master drawing (shown with a special symbol on the drawing list).

Tekla.Structures.Drawing.Drawing.IsLocked
Describes whether the drawing is locked.

Tekla.Structures.Drawing.Drawing.IsIssued
Describes whether the drawing is issued.

Tekla.Structures.Drawing.Drawing.IsIssuedButModified
Describes whether the drawing is issued but modified since it was issued.

Tekla.Structures.Drawing.Drawing.IsFrozen
Describes whether the drawing is frozen.

Tekla.Structures.Drawing.Drawing.IsReadyForIssue
Describes whether the drawing is ready for issue.

Tekla.Structures.Drawing.Drawing.Title1
The first drawing title.

Tekla.Structures.Drawing.Drawing.Title2
The second drawing title.

Tekla.Structures.Drawing.Drawing.Title3
The third drawing title.

Tekla.Structures.Drawing.Drawing.Mark
The drawing mark.

Tekla.Structures.Drawing.Drawing.CreationDate
The drawing creation date.

Tekla.Structures.Drawing.Drawing.ModificationDate
The drawing modification date.

Tekla.Structures.Drawing.Drawing.IssuingDate
The drawing issuing date.

Tekla.Structures.Drawing.Drawing.OutputDate
The drawing output date. XS_DISABLE_DRAWING_PLOT_DATE controls whether this date is set.

Tekla.Structures.Drawing.Drawing.Layout
Gets the drawing layout attributes.

Tekla.Structures.Drawing.Drawing.SectionViewStartLabel
Gets the drawing attribute for start label of section view

Tekla.Structures.Drawing.Drawing.IsReadyForIssueBy
Gets the logged in username that set the drawing Ready for issue

Tekla.Structures.Drawing.Drawing.IsLockedBy
Gets the logged in username that set the drawing to locked

Tekla.Structures.Drawing.Drawing.CommitMessage
Gets the commit message

Tekla.Structures.Drawing.Drawing.#ctor(System.Boolean,Tekla.Structures.Drawing.DrawingType)
Create a Drawing instance

Tekla.Structures.Drawing.Drawing.GetSheet
Gets the sheet of the drawing.
Returns: The sheet of the drawing.

Tekla.Structures.Drawing.Drawing.GetIdsOfUnnumberedDrawings(System.Collections.Generic.IList{Tekla.Structures.Drawing.Drawing})
Returns the list of identifiers of those drawings in the input that are NOT up to date
regarding numbering in the drawing
drawingsToBeChecked: The list of drawings that we want to check for numbering status
Returns: List of the unnumbered drawings' IDs

Tekla.Structures.Drawing.Drawing.IsSameDatabaseObject(Tekla.Structures.Drawing.DatabaseObject)
Returns true if the current object and the given object are referencing the same database object.
Object: The other object to be used.
Returns: True if the objects are referencing the same database object.

Tekla.Structures.Drawing.Drawing.GetMaxPropertyValueStringLength


Tekla.Structures.Drawing.Drawing.QueryUserPropertySet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Sets a user property (UDA) to the drawing.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.QueryUserPropertyGet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Gets a user property (UDA) from the drawing.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.CommitChanges
Commits the changes made to the drawings database so far.
Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo.
Commit also executes all messages.
Please note that you need to also to save the drawings database to persists the changes to disk.
Returns: True on success.
Deprecated since TS v2018.

Tekla.Structures.Drawing.Drawing.CommitChanges(System.String)
Commits the changes made to the drawings database so far.
Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo.
Commit also executes all messages.
Please note that you need to also to save the drawings database to persists the changes to disk.
Message: The message to be saved with the commit.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.LoadAttributeFile(System.String)
Deprecated
FileName:
Returns:

Tekla.Structures.Drawing.Drawing.PlaceViews
Places views on the sheet.
Computes the required size of the views to fit the parts, then places the views so that they fit on the sheet and do not overlap.
Adjusts the sheet size if needed.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.Delete
Deletes the drawing. An active drawing cannot be deleted.
Throws Tekla.Structures.Drawing.CannotDeleteActiveDrawingException: Thrown if the drawing is active.
Returns: True on success.

Tekla.Structures.Drawing.Drawing.GetPlotFileName(System.Boolean)
Get plot file name.
Remarks:
Note: The returned plot file name can contain invalid file name characters.
includeRevisionInfo: Whether to include revision info.
Returns: The plot file name or an empty string if an error occured.

Tekla.Structures.Drawing.Drawing.GetPlotFileNameExt(Tekla.Structures.Drawing.IncludeRevisionMarkEnum)
Get plot file name.
Remarks:
Note: The returned plot file name can contain invalid file name characters.
includeRevisionInfo: How or if to include revision info.
Returns: The plot file name or an empty string if an error occured.